tweetclone/app/Models/TweetModel.php

		public function newTweet($curUser, $post)
    {
        $tweet = new Tweet();
        $tweet->user_id = $curUser['userid'];
        $tweet->content = $post['content'];
        $tweet->category = $post['category'];
        $this->save($tweet);
---
INSERT INTO `tweets` (`user_id`, `content`, `category`) VALUES (13, 'haloooo', 'hiburan')

    public function delTweet($user_id, $tweet_id)
    {
        $tweet = $this->find($tweet_id);
        if($tweet){
            if($user_id == $tweet->user_id){
                $this->delete($tweet->id, true);
---
SELECT *
FROM `tweets`
WHERE `tweets`.`id` = '102'
DELETE FROM `tweets`
WHERE `id` IN ('102')