tweetclone/app/Models/UserModel.php

    public function addUser($data)
    {
        $user = new \App\Entities\User();
        $user->username = $data['username'];
        $user->password = $data['password'];
        $user->fullname = $data['fullname'];
        $this->save($user);
---
INSERT INTO `users` (`username`, `password`, `fullname`) VALUES ('hyseng', '$2y$10$ovNsOvQy37LAGUhH2aDQFOfhf2qorg10IROSFscyHmgyHRXU5Icq6', 'yakana anjai slebew')

    public function login($username, $password)
    {
        $user = $this->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'nsyfz'
 LIMIT 1

    public function editProfile($user, $changePassword)
    {
        $profile = $this->find($user['id']);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '13'