tweetclone/app/Controllers/Profile.php

SELECT *
FROM `users`
WHERE `users`.`id` = '13'
---
    public function editForm($user_id){
        $user = $this->userMdl->find($user_id);

SELECT *
FROM `users`
WHERE `users`.`id` = '13'
---
    public function editProfile(){
        $user = $this->userMdl->find($this->request->getPost('id'));