tweetclone/app/Controllers/Tweet.php

    public function __construct()
    {
        $this->categories = (new \Config\AdtConfig())->getCategories();
        $this->sess = session();
        $this->curUser = $this->sess->get('currentuser');

        $this->tweetMdl = new TweetModel();
				$userMdl = new \App\Models\UserModel();
        $this->profile = $userMdl->find($this->curUser['userid']);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 13